[
  {
    "imageSrc": "druid.png",
    "imageAlt": "Website preview, gray and red color scheme.",
    "title": "Druid Website Renewal",
    "description": "Project done as part of my studies in React and Drupal course. Website made for Druid Oy using Drupal as backend and React as frontend.",
    "link": "https://github.com/ekundayoSO/druid-final-project-team1",
    "type": "application"
  },
  {
    "imageSrc": "tbuddy.png",
    "imageAlt": "Website preview, island picture behind symbols.",
    "title": "Travel Buddy",
    "description": "This is a symfony web app for making travel plans for different locations. The app was originally done as a group project for Business College Helsinki's full stack course.",
    "link": "https://github.com/hetti-r/TravelBuddy?tab=readme-ov-file",
    "type": "application"
  },
  {
    "imageSrc": "countries.png",
    "imageAlt": "Website preview, globe icon, blue background.",
    "title": "React + Redux Countries",
    "description": "A full-stack app for searching countries and showing basic country and weather info fetched from APIs. Has loggin and registation form and functionality to add personal favourite countries.",
    "link": "https://github.com/hetti-r/Redux-Countries",
    "type": "application"
  },
  {
    "imageSrc": "zoo.png",
    "imageAlt": "Website preview, green leafy banner, animal photos in cards.",
    "title": "React Zoo",
    "description": "This is a simple app for displaying categories of animals and having options to like, dislike and delete them. Every animal has an additional single page with a bigger image and a little snippet of information coming from the Wikipedia. The project was done as an exercise for a React course. It uses React and Vite as it's base and an Javascript object and Wikpedia REST API as the data. ",
    "link": "https://github.com/hetti-r/React-Zoo-App",
    "type": "application"
  },
  {
    "imageSrc": "drutheme.png",
    "imageAlt": "Website preview, vector dodo and abstract pattern.",
    "title": "Drupal Theme",
    "description": "A custom theme for Drupal made as a part of my studies in Drupal course. The theme was made for a fictional company called Dodo News.",
    "link": "https://github.com/hetti-r/Drupal-Icecream-Theme?tab=readme-ov-file",
    "type": "application"
  },
  {
    "imageSrc": "pfolio.png",
    "imageAlt": "Website preview, pixel coffee cup and text.",
    "title": "Drupal Portfolio",
    "description": "This is a progressively decoupled full-stack web application that uses Drupal for the backend and React for the frontend. React theme works as the front end view fetching data via JSON:API module and Drupal works behind the scenes as the CMS.",
    "link": "https://github.com/hetti-r/Drupal-Portfolio",
    "type": "application"
  },
  {
    "imageSrc": "fart.png",
    "imageAlt": "Pixel Clown game scene",
    "title": "Clown School Class 1: Farthabet",
    "description": "Farthabet is a 2D reaction game where the player must enter given letters as quickly as possible to appease the school master of the Clown School. The game was made for the Global Game Jam 2024 where I worked as a 2D graphics artist in a team.",
    "link": "https://lennysmithgames.itch.io/clown-class-1-farthabet",
    "type": "game"
  },
  {
    "imageSrc": "pikkuli.jpg",
    "imageAlt": "Cartoon orange bird feeds a toy bird.",
    "title": "Pikkuli",
    "description": "Pikkuli is a children's animated series about a little bird named Pikkuli and his family. I worked as assistant screenwriter for the series. Pikkuli has been broadcasted in over 40 countries.",
    "link": "https://areena.yle.fi/1-3832826",
    "type": "film"
  },
  {
    "imageSrc": "yeti.png",
    "imageAlt": "Snowy scenery with a yeti",
    "title": "Yeti Ski",
    "description": "Yeti Ski is a procedurally generated skiing game where the player jumps over obstacles as a yeti fleeing from the approaching avalanche. I worked as a 2D/concept artist and also did rigging and animating for this project in GamePro study program.",
    "link": "https://h3tt1.itch.io/yeti-ski",
    "type": "game"
  },
  {
    "imageSrc": "dodo.png",
    "imageAlt": "Funny looking dodo birds",
    "title": "Dodo Sapiens",
    "description": "Dodo Sapiens was a final game project for my year of game studies in HEO academy. I worked as a game and level designer as well as an animator and 2D artist. Dodo Sapiens is a time limited game with a collect and drop - mechanics.",
    "link": "https://youtu.be/rYB4JmqTs7k",
    "type": "game"
  },
  {
    "imageSrc": "grandpa.png",
    "imageAlt": "Red sick rat drawing with title.",
    "title": "Grandfather's ghost gave me quite the spook",
    "description": "My first time of participating in the Global Game Jam. In this game you play as a young woman who gets a task from her granpa’s ghost to take care of his garden. Player needs to protect the garden from attacking rats. My role was an animator and a 2D artist.",
    "link": "https://www.youtube.com/watch?v=Hw4SKmZpsCo",
    "type": "game"
  },
  {
    "imageSrc": "crypt.png",
    "imageAlt": "Loading screen with footprints and forest silhuette with eyes.",
    "title": "Cryptid Watch",
    "description": "Game art and design for a game project in Game Desing study program at HEO. Cryptid Watch is a game where the player is a cryptid photographer in a forest. The player needs to take pictures of cryptids and avoid getting caught by the forest ranger. I worked as the art lead and a game designer.",
    "link": "https://www.youtube.com/watch?v=Hw4SKmZpsCo",
    "type": "game"
  },
  {
    "imageSrc": "tapio.png",
    "imageAlt": "Drawn title on forest background.",
    "title": "Who Walks In The Forest Tapio?",
    "description": "Who Walks in the forest, Tapio? is an animated short film for children where a young immigrant girl, Fatima gets lost in the forest and befriends an elk calf and a forest spirit. The story is set in the present day and it has themes of finding your own identity, xenophobia and living in a foreign country.",
    "link": "https://www.youtube.com/watch?v=7WBa82oASkI",
    "type": "film"
  },
  {
    "imageSrc": "gas.jpg",
    "imageAlt": "Drawn animation of girl laying on a bed, black and white",
    "title": "Gaslighting",
    "description": "Gaslighting is an animated short film about a journey to recovery taking place in different parts of the mind. I worked as a writer, director, producer, and animator. It was the final work for my course in Voionmaa Institute. The film was selected for several film festivals, including Tampere Film Festival.",
    "link": "https://vimeo.com/139064740",
    "type": "film"
  },
  {
    "imageSrc": "kuuhun.png",
    "imageAlt": "Film preview, ppainted smiling moon.",
    "title": "Raketilla Kuuhun",
    "description": "Music video for the song Raketilla Kuuhun by the Finnish band Auringon Lapset. I worked as an art director with a small team. The video was made as a part of my studies in Voionmaa Institute.",
    "link": "https://www.youtube.com/watch?v=09SoMU-qrgU",
    "type": "film"
  }
]