[
  {
    "imageSrc": "fart.png",
    "imageAlt": "Pixel Clown game scene",
    "title": "Farthabet",
    "description": "Farthabet is a 2D reaction game where the player must enter given letters as quickly as possible to appease the school master of the Clown School. The game was made for the Global Game Jam 2024 where I worked as a 2D graphics artist in a team.",
    "link": "https://lennysmithgames.itch.io/clown-className-1-farthabet",
    "type": "game"
  },
  {
    "imageSrc": "yeti.png",
    "imageAlt": "Snowy scenery with a yeti",
    "title": "Yeti Ski",
    "description": "Yeti Ski is a procedurally generated skiing game where the player jumps over obstacles as a yeti fleeing from the approaching avalanche. I worked as a 2D/concept artist and also did rigging and animating for this project in GamePro study program.",
    "link": "https://h3tt1.itch.io/yeti-ski",
    "type": "game"
  },
  {
    "imageSrc": "dodo.png",
    "imageAlt": "Funny looking dodo birds",
    "title": "Dodo Sapiens",
    "description": "Dodo Sapiens was a final game project for my year of game studies in HEO academy. I worked as a game and level designer as well as an animator and 2D artist. Dodo Sapiens is a time limited game with a collect and drop - mechanics.",
    "link": "https://youtu.be/rYB4JmqTs7k",
    "type": "game"
  },
  {
    "imageSrc": "gas.jpg",
    "imageAlt": "Drawn animation of girl laying on a bed, black and white",
    "title": "Gaslighting",
    "description": "Gaslighting is an animated short film about a journey to recovery taking place in different parts of the mind. I worked as a writer, director, producer, and animator. It was the final work for my course in Voionmaa Institute. The film was selected for several film festivals, including Tampere Film Festival.",
    "link": "https://vimeo.com/139064740",
    "type": "film"
  },
  {
    "imageSrc": "druid.png",
    "imageAlt": "Website preview, gray and red color scheme.",
    "title": "Druid Website Renewal",
    "description": "Project done as part of my studies in React and Drupal course. Website made for Druid Oy using Drupal as backend and React as frontend.",
    "link": "https://github.com/ekundayoSO/druid-final-project-team1",
    "type": "application"
  },
  {
    "imageSrc": "tbuddy.png",
    "imageAlt": "Website preview, island picture behind symbols.",
    "title": "Travel Buddy",
    "description": "This is a symfony web app for making travel plans for different locations. The app was originally done as a group project for Business College Helsinki's full stack course.",
    "link": "https://github.com/hetti-r/TravelBuddy?tab=readme-ov-file",
    "type": "application"
  }
]