[  
  {
    "id": "16",
    "imageSrc": "portfolio.png",
    "imageAlt": "Website preview, pixel meadow.",
    "title": "Portfolio Website",
    "description": "This is my portfolio website made with React and Vite. The website is made to showcase my projects and skills.",
    "longDescription": "This portfolio website showcases my work as a developer, game designer, and creative professional. Built using React and Vite for optimal performance, the site features a responsive design that adapts seamlessly across devices. The visual style incorporates pixel art elements and a cohesive color scheme designed in Figma, reflecting my background in game development and digital art.\n\nKey features include:\n• Filtering for dynamic project cards \n• Single project pages for displaying my work across different mediums\n• Interactive skill visualization system\n• Responsive navigation and layout\n• Custom pixel art assets and animations\n• Integration with GitHub for project hosting\n\nThe development process focused on component reusability and clean code architecture. I implemented custom hooks for data management and utilized modern React features like functional components and hooks. The project helped me deepen my understanding of React's component lifecycle, state management, and responsive design principles.",
    "tags": ["React", "Vite", "Figma"],
    "link": "https://github.com/hetti-r/ReactPortfolio",
    "figma": "https://embed.figma.com/design/z6KTXkCvnrCjiocgxsEtaE/Style-Guide?node-id=3-12&embed-host=share",
    "type": "application"
  },
  {
    "id": "15",
    "imageSrc": "druid.png",
    "imageAlt": "Website preview, gray and red color scheme.",
    "title": "Druid Website Renewal",
    "description": "Project done as part of my studies in React and Drupal course. Website made for Druid Oy using Drupal as backend and React as frontend.",
    "longDescription": "This project was done as a part of my studies in React and Drupal course at Business College Helsinki. The task was to renew a  company website in collaboration with Druid Oy to meet their specific requirements. We integrated Drupal as the backend and React.js as the frontend.\nThis project demonstrates an interaction between these technologies, where Drupal handles content management, and React provides a dynamic front-end interface using JSON. The communication between the two platforms is facilitated through JSON:API.\nThe website was made as a group project with four other students. My role in the project was to design the website and make a prototype in Figma, create the React frontend, and to make the website responsive. The project was done in two months.",
    "tags": ["React", "Drupal", "Figma", "JSON:API"],
    "link": "https://github.com/ekundayoSO/druid-final-project-team1",
    "video": "https://www.youtube.com/embed/gdJrWDPxBuc?si=71MdnBDiJYGurh2Z",
    "figma": "https://embed.figma.com/design/EtW5W0zftevxZgDfHUABrV/Druid-Renewal?embed-host=share",
    "type": "application"
  },
  {
    "id": "14",
    "imageSrc": "countries.png",
    "imageAlt": "Website preview, globe icon, blue background.",
    "extraImages": [
      {
        "src": "https://github.com/hetti-r/Redux-Countries/raw/main/preview2.png",
        "alt": "Website preview, cards with countries."
      }
    ],
    "title": "React + Redux Countries",
    "description": "A full-stack app for searching countries and showing basic country and weather info fetched from APIs. Has login and registration form and functionality to add personal favourite countries.",
    "longDescription": "This application offers a comprehensive country exploration experience with the following features:\nUser Management: Secure authentication system that stores login information and personal country favorites in a database.\nCountries Explorer: Browse through countries with detailed information and use the search functionality to filter results.\nFavorites System: Add countries to your personal favorites list for quick access, and easily manage your selections. Detailed Country Views: Access expanded information about each country including full flag display and real-time weather data.\nModern Tech Stack: Built with JavaScript, React/Vite frontend, Firebase backend, Redux for state management, Bootstrap and React Icons for styling, and integration with Rest Countries API, Firebase Firestore, and Open Weather API.",
    "tags": ["React", "Redux", "Firebase", "REST API", "Bootstrap"],
    "link": "https://github.com/hetti-r/Redux-Countries",
    "type": "application"
  },
  {
    "id": "13",
    "imageSrc": "zoo.png",
    "imageAlt": "Website preview, green leafy banner, animal photos in cards.",
    "title": "React Zoo",
    "description": "A React app for displaying categories of animals and having options to like, dislike and delete them. Every animal has an additional single page with a little snippet of information coming from the Wikipedia. It uses React and Vite as its base and a Javascript object and Wikipedia REST API as the data.",
    "longDescription": "This is a web app for displaying categories of animals and having options to like, dislike and delete them. Every animal has an additional single page with a bigger image and a little snippet of information coming from the Wikipedia. All the animal pictures come from Unsplash and are randomized when the page is refreshed. The header image changes by the category and uses a random image with unique search words such as forest and sky.\nThe project was done as an exercise for a React course. It uses React and Vite as it's base and an Javascript object and Wikpedia REST API as the data. The React course and the code base was given by Margit Tennosaar at Business College Helsinki.",
    "tags": ["React", "Vite", "REST API"],
    "link": "https://github.com/hetti-r/React-Zoo-App",
    "type": "application"
  },
  {
    "id": "12",
    "imageSrc": "tbuddy.png",
    "imageAlt": "Website preview, island picture behind symbols.",
    "extraImages": [
      {
        "src": "https://github.com/hetti-r/TravelBuddy/raw/main/preview2.png",
        "alt": "Website preview, travel plans."
      },
      {
        "src": "https://github.com/hetti-r/TravelBuddy/raw/main/preview3.png",
        "alt": "Website preview, create travel plan."
      },
      {
        "src": "https://github.com/hetti-r/TravelBuddy/raw/main/preview4.png",
        "alt": "Website preview, view travel plan."
      }
    ],
    "title": "Travel Buddy",
    "description": "This is a symfony web app for making travel plans for different locations. The app was originally done as a group project for Business College Helsinki's full stack course.",
    "longDescription": "This is a Symfony web app for making travel plans for different locations. The app was originally done as a group project for Business College Helsinki's full-stack course. The app uses symfony CRUD and postgresql to make a database of the travel plans. You can use a form to add plans to the database and also display, edit and delete plans. The app uses pictures from Unsplash and icons from icons8. \n I was responsible for making a wireframe prototype in Figma, designing the CRUD and database, and making the front end with Twig.",
    "tags": ["Symfony", "PostgreSQL", "Twig", "Figma"],
    "link": "https://github.com/hetti-r/TravelBuddy?tab=readme-ov-file",
    "figma": "https://embed.figma.com/design/ftj2kg6ckCIBdME6Z54alC/Prototype?node-id=0-1&embed-host=share",
    "type": "application"
  },
  {
    "id": "11",
    "imageSrc": "drutheme.png",
    "imageAlt": "Website preview, vector dodo and abstract pattern.",
    "title": "Drupal Theme",
    "description": "A custom theme for Drupal made as a part of my studies in Drupal course. The theme was made for a fictional company called Dodo News.",
    "longDescription": "A comprehensive Drupal theme development project showcasing integration of modern web technologies. Built using Drupal 11's theming system, featuring custom views.\nKey features include: responsive layout design, custom templates for content presentation and integration with Drupal's JSON:API for headless CMS capabilities. Development environment was set up using Lando for containerization, with proper version control through Git.\nThe project demonstrates proficiency in both frontend development (HTML, CSS, JavaScript) and Drupal's backend architecture, including content type configuration, taxonomy management, and block placement strategies.",
    "tags": ["Drupal", "JSON:API", "Lando"],
    "link": "https://github.com/hetti-r/Drupal-Icecream-Theme?tab=readme-ov-file",
    "type": "application"
  },
  {
    "id": "10",
    "imageSrc": "pfolio.png",
    "imageAlt": "Website preview, pixel coffee cup and text.",
    "title": "React + Drupal Portfolio",
    "description": "This is a fully decoupled full-stack web application that uses Drupal for the backend and React for the frontend. React theme works as the front end view fetching data via JSON:API module and Drupal works behind the scenes as the CMS.",
    "longDescription": "A full-stack portfolio website demonstrating decoupling with Drupal and React. The backend uses Drupal 11 as a headless CMS with JSON:API module to serve structured content types (Home, About, Projects). The frontend is built with React, fetching data dynamically through RESTful endpoints.\nThe development environment utilizes Lando for local Drupal setup with MySQL database support. The architecture showcases modern web development practices with separated concerns - content management in Drupal and presentation in React.",
    "tags": ["React", "Drupal", "JSON:API", "Lando"],
    "video": "https://www.youtube.com/embed/lO4QDGy0Ghw?si=Hhvr90H3vVYgnUcn",
    "link": "https://github.com/hetti-r/Drupal-Portfolio",
    "type": "application"
  },
  {
    "id": "9",
    "imageSrc": "fart.png",
    "imageAlt": "Pixel Clown game scene",
    "title": "Clown School Class 1: Farthabet",
    "description": "Farthabet is a 2D reaction game where the player must enter given letters as quickly as possible to appease the school master of the Clown School. The game was made for the Global Game Jam 2024 where I worked as a 2D graphics artist in a team.",
    "longDescription": "Clowns are known for being either uncannily scary or harmlessly funny, and in Clown School Class 1: Farthabet, you experiece both of these sides. This 2D reaction game challenges players to enter given letters as quickly as possible to appease the school master of the Clown School. The game was developed during Global Game Jam 2024 with theme: Make me laugh, where I contributed as a 2D graphics artist.\nAs part of the game development team, I was responsible for creating custom 2D artwork, including character designs, environmental assets, and UI elements. The project was developed in Unity and features a unique art style inspired by classic clown imagery. The game's core mechanics focus on player reaction time and accuracy, with a humorous twist (fart sounds) that captures the otherwise horrifying spirit of clown school antics.",
    "tags": ["2D Art", "Game Design", "Game Jam"],
    "link": "https://lennysmithgames.itch.io/clown-class-1-farthabet",
    "type": "game"
  },
  {
    "id": "8",
    "imageSrc": "pikkuli.jpg",
    "imageAlt": "Cartoon orange bird feeds a toy bird.",
    "title": "Pikkuli",
    "description": "Pikkuli is a children's animated series about a little bird named Pikkuli and his family. I worked as assistant screenwriter for the series. Pikkuli has been broadcasted in over 40 countries.",
    "longDescription": "Pikkuli is a children's animated series about a little bird named Pikkuli and his family. The series follows Pikkuli's adventures as he learns about the world around him and grows up with the help of his family. I worked as an assistant screenwriter for the upcoming second season of the series as well as the feature film Pikkuli and The Starlight Reindeer, contributing to the development of episode scripts and storylines.\n During this experience, I gained valuable insights into professional screenwriting processes, including script formatting, story arc development, and writing for young audiences. I learned to collaborate with a creative team, incorporate feedback from the director and co-writers, and adapt stories to meet both creative and production requirements. Working on an internationally broadcast series also taught me about creating content that resonates across different cultures while maintaining educational value.\n Pikkuli has been broadcasted in over 40 countries and has received critical acclaim for its educational content and engaging storytelling. The series is produced by Sun in Eye Productions and has been recognized for its positive impact on children's learning and development.",
    "tags": ["Screenwriting", "Animation"],
    "link": "https://areena.yle.fi/1-3832826",
    "type": "film"
  },
  {
    "id": "7",
    "imageSrc": "yeti.png",
    "imageAlt": "Snowy scenery with a yeti",
    "title": "Yeti Ski",
    "description": "Yeti Ski is a procedurally generated skiing game where the player jumps over obstacles as a yeti fleeing from the approaching avalanche. I worked as a 2D/concept artist and also did rigging and animating for this project in GamePro study program.",
    "longDescription": "Yeti Ski is a 2D skiing game developed during the GamePro study program. The game features procedurally generated levels where players control a yeti character skiing down a mountain. The core gameplay involves jumping over obstacles to survive the avalanche chasing the player.\nAs a 2D artist, I was responsible for creating concept art, character designs, and environmental assets. I also did animation and rigging, including character movement and avalanche animations. The project was developed in Unity and features custom 2D artwork created in Adobe Photoshop.",
    "tags": ["2D Art", "Animation", "Game Design"],
    "link": "https://h3tt1.itch.io/yeti-ski",
    "type": "game"
  },
  {
    "id": "6",
    "imageSrc": "dodo.png",
    "imageAlt": "Funny looking dodo birds",
    "title": "Dodo Sapiens",
    "description": "Dodo Sapiens was a final game project for my year of game studies in HEO academy. I worked as a game and level designer as well as an animator and 2D artist. Dodo Sapiens is a time limited game with a collect and drop - mechanics.",
    "longDescription": "Dodo Sapiens is a 2D game developed during the GamePro study program at HEO Academy. The game features a time-limited challenge where players must collect and drop dodo chicks to progress through levels. The core mechanics involve navigating the environment as well as avoiding obstacles and enemies to complete objectives.\nAs a game and level designer, I was responsible for creating the game's core mechanics, level layouts, and progression systems. I also contributed to the game's visual design, including character animations and environmental assets. The project was developed in Unity and features custom 2D artwork created in Adobe Photoshop.\nCreated by a team of three people: Liisa Pirhonen (Art),and Lenny Smith (Design, Code) and me.",
    "tags": ["2D Art", "Game Design", "Animation"],
    "pdf": "dodo.pdf",
    "video": "https://www.youtube.com/embed/rYB4JmqTs7k?si=eGmjV3VRYoK-fsqn",
    "type": "game"
  },
  {
    "id": "5",
    "imageSrc": "grandpa.png",
    "imageAlt": "Red sick rat drawing with title.",
    "title": "Grandfather's ghost gave me quite the spook",
    "description": "My first time of participating in the Global Game Jam. In this game you play as a young woman who gets a task from her grandpa's ghost to take care of his garden. Player needs to protect the garden from attacking rats. My role was an animator and a 2D artist.",
    "longDescription": "Developed during Global Game Jam 2019 at FGJ Helsinki Arabia, this Unity-based game tells the story of a young girl who must help set her grandfather's ghost free to restore peace to her old home. \nPlayers use W-A-S-D controls to navigate through the environment while protecting the grandfather's beloved garden from invasive rats. The game features custom 2D artwork created in Adobe Photoshop, including character animations and environmental assets. \nCreated by a team of 8 people: Ivo Van 'T Wout and Lenny Smith (Design), Mikael Jaakkola (Programming), Hetti Rönnemaa and Liisa Pirhonen (Art), Ville Holmström (Sound), with Lenny Smith as Project Manager and Akseli Haataja as Production Assistant. Available for Windows platforms.",
    "tags": ["Game Design", "2D Art", "Game Jam"],
    "video": "https://www.youtube.com/embed/Hw4SKmZpsCo?si=2Iu0uuH05PE-pSKc",
    "link": "https://v3.globalgamejam.org/2019/games/grandfathers-ghost-gave-me-quite-spook",
    "type": "game"
  },
  {
    "id": "4",
    "imageSrc": "crypt.png",
    "imageAlt": "Loading screen with footprints and forest silhouette with eyes.",
    "title": "Cryptid Watch",
    "description": "Game art and design for a game project in Game Design study program at HEO. Cryptid Watch is a game where the player is a cryptid photographer in a forest. The player needs to take pictures of cryptids and avoid getting caught by the forest ranger. I worked as the art lead and a game designer.",
    "longDescription": "Cryptid Watch is a game project developed during the game design study program at HEO Academy. The game is set in a mysterious forest where players take on the role of a cryptid photographer. The objective is to capture photos of elusive cryptids. \nAs the art lead and game designer, I was responsible for creating the game's visual style and designing the core gameplay mechanics. The project involved concept art, character design, and UI layout, with a focus on creating an immersive forest environment.",
    "tags": ["Game Design", "2D Art", "Art Direction"],
    "type": "game"
  },
  {
    "id": "3",
    "imageSrc": "tapio.png",
    "imageAlt": "Drawn title on forest background.",
    "title": "Who Walks In The Forest Tapio?",
    "description": "Who Walks in the forest, Tapio? is an animated short film for children where a young immigrant girl, Fatima gets lost in the forest and befriends an elk calf and a forest spirit. The story is set in the present day and it has themes of finding your own identity, xenophobia and living in a foreign country.",
    "longDescription": "ho Walks in the forest, Tapio? is an animated short film for children where a young immigrant girl, Fatima gets lost in the forest and befriends an elk calf and a forest spirit. While they play together in the forest the girl transforms into a strange creature and needs the help of the forest god to get back to herself. The story is set in the present day and it has themes of finding your own identity, xenophobia and living in a foreign country.\nThe film was made as part of my Bachelor's thesis in The University of West of Scotland. The script and the animatic were made by me and I hope to make the film in full animation in the future.",
    "tags": ["Animation", "Screenwriting", "2D Art"],
    "link": "https://www.youtube.com/watch?v=7WBa82oASkI",
    "type": "film"
  },
  {
    "id": "2",
    "imageSrc": "gas.jpg",
    "imageAlt": "Drawn animation of girl laying on a bed, black and white",
    "title": "Gaslighting",
    "description": "Gaslighting is an animated short film about a journey to recovery taking place in different parts of the mind. I worked as a writer, director, producer, and animator. It was the final work for my course in Voionmaa Institute. The film was selected for several film festivals, including Tampere Film Festival.",
    "longDescription": "Gaslighting is an animated short film about a woman who struggles to overcome the aftermath of her emotional abuse. The journey to recovery takes her to different places of her mind.\n I worked as the writer/director/producer alongside with my cinematographer Veera Ruoholinna and my sound designer Aleksi Klemetti. The film was selected to Tampere Film Festival, Animatricks and Athens Animfest Competition Selection. ",
    "tags": ["Animation", "Screenwriting", "Directing", "2D Art"],
    "link": "https://vimeo.com/139064740",
    "video": "https://player.vimeo.com/video/139064740?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479",
    "type": "film"
  },
  {
    "id": "1",
    "imageSrc": "kuuhun.png",
    "imageAlt": "Film preview, painted smiling moon.",
    "title": "Raketilla Kuuhun",
    "description": "Music video for the song Raketilla Kuuhun by the Finnish band Auringon Lapset. I worked as an art director with a small team. The video was made as a part of my studies in Voionmaa Institute.",
    "longDescription": "Raketilla Kuuhun is a music video for the song by the Finnish band Auringon Lapset. As a part of my studies in Voionmaa Institute, the project was made with a small team where I worked as an art director.\n The video was made with a small budget, a tight schedule and lots of passion. The sets in the video were hand painted and it was filmed as a one continuous shot.",
    "tags": ["Art Direction", "Music Video"],
    "video": "https://www.youtube.com/embed/09SoMU-qrgU?si=PRZw1FWPIen_43A8",
    "link": "https://www.youtube.com/watch?v=09SoMU-qrgU",
    "type": "film"
  }
]